import re
from toolz import compose


st = """4F-D-W16(I9)	4.2	G1/17	10.131.88.167	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	4.3	G1/18	10.131.88.168	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	4.4	G1/19	10.131.88.169	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	4.5	G1/20	10.131.88.170	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	5.1	G1/21	10.131.88.171	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	5.2	G1/22	10.131.88.172	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	5.3	G1/23	10.131.88.173	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	5.4	G1/24	10.131.88.174	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	5.5	G1/25	10.131.88.175	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	6.1	G1/26	10.131.88.176	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	6.2	G1/27	10.131.88.177	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	6.3	G1/28	10.131.88.178	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	6.4	G1/29	10.131.88.179	2021-8-9万丽交付NV-Ti
4F-D-W16(I9)	6.5	G1/30	10.131.88.180	2021-8-9万丽交付NV-Ti
"""

print("()".replace("(","\("))
print(re.findall(r".*4F-D-W16(I9)", st))
# print(re.findall(".*{}.*{}.*".format("4F-D-W16(I9)","6.1"), st))


s = ['1.dat','10.dat','5.dat','5.aat']
res = sorted(s, key=compose(lambda x: (int(x[0]), x[1]), lambda x: x.split('.')))
print(res)

print("\n".join(s))